TRUNCATE TABLE medicine RESTART IDENTITY CASCADE;

INSERT INTO medicine (name, serial_number, expiration_date)
VALUES ('Аспирин', 'SN101', '2024-12-22'),
       ('Парацетамол', 'SN102', '2025-01-15'),
       ('Ибупрофен', 'SN103', '2025-02-10'),
       ('Анальгин', 'SN104', '2024-11-30'),
       ('Кальция глюконат', 'SN105', '2025-03-05'),
       ('Мезатон', 'SN106', '2024-10-20'),
       ('Лоратадин', 'SN107', '2025-04-18'),
       ('Цитрамон', 'SN108', '2025-05-25'),
       ('Мефенамовая кислота', 'SN109', '2024-09-12'),
       ('Нурофен', 'SN110', '2025-06-30');

